from os import getcwd, getenv, mkdir, system
from os.path import join

fp = getcwd()

EMPTY_UUID = '00000000-0000-0000-0000-000000000000'
ST_WORK_SPACE = join(str(getenv('APPDATA')), 'simple_tools')

science_tuple = ('', 'K', 'M', 'B', 'T', 'P', 'E', 'Z', 'Y', 'S', 'L', 'X', 'D', 'C', 'H', 'I', 'N', 'A', 'F', 'G',
                 'J', 'O')

tabs_bl = (("└─", "   "), ("├─", "│  "))

tabs = (('┌', '┬', '┐', '├', '┼', '┤', '└', '┴', '┘',),
        ('╔', '╦', '╗', '╠', '╬', '╣', '╚', '╩', '╝',),
        ('┏', '┳', '┓', '┣', '╋', '┫', '┗', '┻', '┛',),
        ('│', '╳', '┃', ' ', '╭', '─', '╮', '╰', '━', '╯',),)

usernameList = (('高大', '英俊', '美丽', '优雅', '活泼', '时尚', '聪明', '能干', '健康', '勤劳',
                 '阳光', '好学', '俏丽', '忠心', '善良', '坚强', '独立', '团结', '优美', '义气',
                 '智慧', '大度', '豁达', '开朗', '富有', '专心', '勤劳', '乐观', '可爱', '热心',
                 '孝顺', '妩媚', '丽人', '矜持', '佳丽', '柔美', '婉丽', '娉婷', '婉顺', '娇柔',
                 '可爱', '温柔', '体贴', '贤惠', '贤慧', '才干', '人才', '袅娜', '赞美', '赞赏',
                 '端庄优雅', '大家闺秀', '优雅大方', '婀娜多姿', '秀外慧中',
                 '面若桃花', '天生丽质', '如琬似花', '宛如天仙', '仙女下凡',
                 '气质非凡', '秀而不媚', '长相骏雅', '身付异秉', '才思敏捷',
                 '过目不忘', '十年寒窗', '博学多才', '见多识广', '才高八斗',
                 '学富五车', '文武双全', '雄韬伟略', '谈吐不凡', '谈笑风声',
                 '高谈阔论', '运筹帷幄', '言简意赅', '完美无缺', '一针见血',
                 '远见卓识', '义正词严', '一气呵成', '大显神通', '出口成章',
                 '出类拔萃', '出神入化', '万古流芳', '一本正经', '一箭双雕',
                 '长篇大论', '功德无量', '力排众议', '力挽狂澜', '气贯长虹',
                 '气势磅礴', '气吞山河', '坚韧不拔', '身体力行', '空前绝后',
                 '视死如归', '英姿焕发', '奉公守法', '艰苦奋斗', '忠贞不渝',
                 '舍己为人', '大公无私', '一尘不染', '一鸣惊人', '叱诧风云',
                 '排山倒海', '惊涛骇浪', '雷霆万钧', '惊心动魄', '横扫千军',
                 '惊天动地', '文从字顺', '十全十美', '无懈可击', '无与伦比',
                 '励精图治', '壮志凌云', '高瞻远瞩', '忍辱负重', '盖世无双',
                 '龙飞凤舞', '一丝不苟', '身兼数职', '日理万机', '明察秋毫',
                 '英明果断', '分身有术', '孜孜不倦', '慧质兰心', '清新单纯',
                 '沉鱼落雁', '闭月羞花', '回眸一笑百媚生'),
                ('看', '望', '瞥', '视', '盯', '瞧', '窥', '瞄', '眺', '瞪',
                 '咬', '吞', '吐', '吮', '吸', '啃', '喝', '吃', '咀', '嚼',
                 '说', '看', '走', '听', '笑', '拿', '伯', '是', '为', '乃',
                 '跑', '吃', '唱', '喝', '敲', '坐', '盯', '踢', '闻', '摸',
                 '搀', '抱', '搂', '扶', '捉', '擒', '掐', '推', '拿', '抽',
                 '撕', '摘', '拣', '捡', '打', '播', '击', '捏', '撒', '按',
                 '弹', '撞', '提', '扭', '捶', '持', '揍', '披', '捣', '搜',
                 '托', '举', '拖', '擦', '敲', '挖', '抛', '掘', '抬', '插',
                 '扔', '写', '抄', '抓', '捧', '掷', '撑', '摊', '倒', '摔',
                 '劈', '画', '搔', '撬', '挥', '揽', '挡', '捺', '抚', '搡',
                 '拉', '摸', '拍', '摇', '剪', '拎', '拔', '拧', '拨', '舞',
                 '握', '攥', '退', '进', '奔', '跑', '赶', '趋', '遁', '逃',
                 '立', '站', '跨', '踢', '跳', '走', '蹬', '窜', '想', '爱',
                 '会', '愿', '配', '去', '肯', '敢', '要', '上', '下', '进',
                 '出', '回', '开', '过', '起', '来', '在', '死', '有', '能', '恨', '瞅',
                 '俯视', '遥望', '凝视', '探望', '看护', '鄙视', '蔑视', '斜视', '歧视', '打量',
                 '探听', '打听', '聆听', '谛听', '静听', '细听', '噘嘴', '嘟嘴', '努嘴', '撇嘴',
                 '颔首', '俯首', '仰头', '点头', '摇头', '低头', '抬头', '伸颈', '缩颈', '歪颈',
                 '屈身', '转体', '倒立', '猫腰', '蜷曲', '侧卧', '俯卧', '仰卧', '躺下', '睡下',
                 '趴下', '蹲下', '弯腰', '弓身', '挺身', '俯身', '哈腰', '飞翔', '吆喝', '消灭',
                 '批评', '宣传', '保卫', '学习', '研究', '进行', '开始', '停止', '禁止', '存在',
                 '等于', '发生', '演变', '发展', '回去', '开去', '过去', '生长', '枯萎', '发芽',
                 '想念', '打算', '喜欢', '希望', '害怕', '担心', '讨厌', '觉的', '思考', '能够',
                 '应当', '应该', '值得', '宁可', '环顾', '鸟瞰', '可以', '愿意', '生长', '死亡',
                 '上来', '下来', '进来', '出来', '回来', '开来', '过来', '起来', '结果', '产卵',
                 '上去', '下去', '进去', '出主',
                 '察言观色', '左顾右盼', '虎视眈眈', '袖手旁观', '面面相觑',
                 '凝神注视', '不屑一顾', '眼珠一转', '东张西望', '眼睛一闪',
                 '明察秋毫', '直眉瞪眼', '目睹一切', '目击现场', '身体后倾',
                 '竖耳静听', '侧耳倾听', '洗耳恭听', '垂手恭听', '耳闻目睹',
                 '舔舔嘴唇', '抿着嘴笑', '小嘴一翘', '细嚼慢咽', '狼吞虎咽',
                 '伸长脖子', '歪着脑袋', '摇头晃脑', '抱头鼠窜', '交头接耳',
                 '垂头丧气', '点头赞许', '低头沉吟', '探头探脑', '昂首挺胸',
                 '埋头苦干', '仰天长啸', '摇头摆尾', '摇头反对', '打拱哈腰',
                 '打个趔趄', '东倒西歪', '脚步不稳', '蹦蹦跳跳', '纵身一跳',
                 '踮起脚尖', '逃之夭夭', '闻风而逃', '原地踏步', '裹足不前',
                 '迎头赶上', '远走高飞', '拔腿就跑', '跛着脚走', '飞檐走壁',
                 '屈膝下跪', '打个踉跄', '自由驰骋', '碎步而行', '跺脚赌气',
                 '拳打脚踢', '直趋而过', '闲庭信步', '弓腿跨步', '踌躇不前',
                 '大步流星', '垂足而立', '长驱直入', '一摇三摆', '挺直腰板',
                 '弯腰弓背', '扭动腰肢', '弯腰作揖'),
                ('大', '小', '长', '早', '全', '好', '坏', '远', '近', '直', '斜',
                 '崎岖', '含糊', '磅礴', '优秀', '聪明', '年轻', '雪白', '笔直', '生动', '固定', '平等',
                 '明晃晃', '热腾腾', '绿油油', '水灵灵', '红彤彤', '亮堂堂', '胖乎乎', '毛乎乎',
                 '黑不溜秋', '老实巴交', '黑咕隆咚', '灰里吧唧', '灰不溜秋',
                 '甜不丝儿', '圆咕隆冬',
                 '大树', '红太阳', '年轻侍者', '皎洁的月光', '丰满的脸蛋',
                 '粗壮的腰', '品行端正', '论述简洁', '描写生动',
                 '语言含蓄', '态度委婉', '观点陈旧'),
                ('时间', '中国', '公司', '信息', '软件', '产品', '工作', '论坛', '企业', '问题',
                 '内容', '市场', '系统', '技术', '现在', '作者', '网络', '文章', '方式', '电话',
                 '时候', '北京', '有限', '什么', '开始', '国家', '生活', '联系', '积分', '主题',
                 '中心', '世界', '价格', '用户', '不是', '个人', '地址', '情况', '设计', '同时',
                 '活动', '手机', '大家', '目前', '文件', '美国', '图片', '经济', '功能', '国际',
                 '会员', '环境', '日期', '专业', '人员', '教育', '资料', '状态', '社会', '名称',
                 '音乐', '等级', '可能', '朋友', '资源', '精华', '电影', '新闻', '安全', '全国',
                 '大学', '学生', '项目', '广告', '方法', '地方', '单位', '今天', '能力', '电脑',
                 '记者', '位置', '这里', '标准', '女人', '设备', '之后', '学校', '组织', '作品',
                 '东西', '方面', '简介', '科技', '其中', '工程', '左右', '过去', '比赛', '旅游',
                 '经验', '地区', '结果', '影响', '行业', '表示', '程序', '规定', '男人', '部门',
                 '数据', '商品', '大小', '关系', '文化', '法律', '城市', '基本', '政府', '威望',
                 '类别', '日本', '责任', '业务', '部分', '中文', '根据', '人民', '次数', '孩子',
                 '语言', '社区', '品牌', '工具', '决定', '事情', '今年', '以后', '老师', '条件',
                 '过程', '类型', '来源', '质量', '汽车', '一点', '历史', '密码', '声音', '建议',
                 '原因', '报告', '当前', '客户', '标题', '空间', '一切', '歌曲', '制度', '基础',
                 '专家', '效果', '集团', '目标', '才能', '权限', '机构', '精神', '级别', '编辑',
                 '知识', '行为', '速度', '经过', '作用', '代表', '意见', '故事', '小时', '水平',
                 '领导', '爱情', '自然', '模式', '平台', '美女', '版权', '人们', '小说', '身体',
                 '机会', '专辑', '会议', '政策', '建筑', '交易', '职业', '结构', '银行', '材料',
                 '英语', '视频', '记录', '下面', '数量', '歌词', '眼睛', '办法', '报道', '食品',
                 '资金', '科学', '电视', '当时', '家庭', '身上', '公告', '思想', '重点', '中华',
                 '连接', '实际', '以前', '先生', '任务', '消息', '传真', '表现', '最近', '原创',
                 '产业', '时代', '医院', '未来', '工业', '力量', '现金', '幸福', '错误', '现代',
                 '商业', '邮件', '频道', '编号', '之前', '教师', '人才', '经典', '传统', '浙江',
                 '里面', '对方', '范围', '生命', '照片', '需求', '女孩', '人生', '行政', '艺术',
                 '商务', '文字', '名字', '魅力', '程度', '交通', '金钱', '歌手', '本地', '学院',
                 '心情', '中央', '机械', '韩国', '代理', '时尚', '晚上', '观点', '形式', '特点',
                 '贡献', '心中', '考虑', '价值', '事件', '人物', '计算机', '服务器',

                 ),)


def _md_dir(__file_path, quiet=False):
    try:
        mkdir(__file_path)
    except FileNotFoundError:
        if not quiet:
            print('创建文件夹时出现错误: 指定的文件夹不存在 - %s\n正在重新创建. . .' % __file_path)
        else:
            pass
        system('md ' + __file_path)
    except FileExistsError:
        if not quiet:
            print('创建文件夹时出现错误 - %s 文件已存在' % __file_path)
        else:
            pass
    else:
        if not quiet:
            print('成功创建 %s 文件夹' % __file_path)
        else:
            pass


def pass_(returns=0, *args, **kwargs):
    """没用的函数

    @return: returns
    """
    if kwargs.get('quiet', False):
        print(args)
        print(kwargs)
    return returns


QUIET_P = True
_md_dir(ST_WORK_SPACE, quiet=QUIET_P)
_md_dir(join(ST_WORK_SPACE, 'bomb'), quiet=QUIET_P)
_md_dir(join(ST_WORK_SPACE, 'data_base'), quiet=QUIET_P)
_md_dir(join(ST_WORK_SPACE, 'data_handle'), quiet=QUIET_P)
_md_dir(join(ST_WORK_SPACE, 'default'), quiet=QUIET_P)
_md_dir(join(ST_WORK_SPACE, 'draws'), quiet=QUIET_P)
_md_dir(join(ST_WORK_SPACE, 'encryption'), quiet=QUIET_P)
_md_dir(join(ST_WORK_SPACE, 'game_disposition'), quiet=QUIET_P)
_md_dir(join(ST_WORK_SPACE, 'gui_extend'), quiet=QUIET_P)
_md_dir(join(ST_WORK_SPACE, 'hash_values'), quiet=QUIET_P)
_md_dir(join(ST_WORK_SPACE, 'maths'), quiet=QUIET_P)
_md_dir(join(ST_WORK_SPACE, 'passed'), quiet=QUIET_P)
_md_dir(join(ST_WORK_SPACE, 'randoms'), quiet=QUIET_P)
_md_dir(join(ST_WORK_SPACE, 'review'), quiet=QUIET_P)
_md_dir(join(ST_WORK_SPACE, 'system_extend'), quiet=QUIET_P)
_md_dir(join(ST_WORK_SPACE, 'test'), quiet=QUIET_P)
_md_dir(join(ST_WORK_SPACE, 'times'), quiet=QUIET_P)

__all__ = [
    'ST_WORK_SPACE',
    'usernameList', 'EMPTY_UUID', 'fp', 'science_tuple', 'tabs', "tabs_bl",
    'pass_'
]
